sprayA_v12/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// ************************************************************************* //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 5.98e06;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    sideA
    {
        type            wedge;
    }
    sideB
    {
        type            wedge;
    }
    centerPlane
    {
        type            empty;
    }
}

// ************************************************************************* //
