sprayA_v12/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// ************************************************************************* //

dimensions          [0 0 0 1 0 0 0];

internalField       uniform 901.0;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform 850;
    }
    sideA
    {
        type            wedge;
    }
    sideB
    {
        type            wedge;
    }
    centerPlane
    {
        type            empty;
    }
}

// ************************************************************************* //
