sprayA_v12/0/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ydefault;
}
// ************************************************************************* //

dimensions          [];

internalField       uniform 0;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    sideA
    {
        type            wedge;
    }
    sideB
    {
        type            wedge;
    }
    centerPlane
    {
        type            empty;
    }
}

// ************************************************************************* //
