sprayA_v12/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.25;


boundaryField
{
    walls
    {
        type            kqRWallFunction;
        value           uniform 0.25;
    }
    sideA
    {
        type            wedge;
    }
    sideB
    {
        type            wedge;
    }
    centerPlane
    {
        type            empty;
    }
}


// ************************************************************************* //
