sprayA_v12/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc graphCell(name=CenterLine, start=(0.0004 0.0 0.1076), end=(0.0004 0 0.0000), fields=(
T N2 AR H O OH HO2 H2 H2O H2O2 O2 CH2 CH2* CH3 CH4 HCO CH2O CH3O CO CO2 C2H2 C2H3 C2H4 C2H5 C2H6 CH2CHO 
aC3H5 C3H6 nC3H7 C2H3CHO C4H7 C4H81 pC4H9 C5H9 C5H10 PXC5H11 C6H12 PXC6H13 C7H14 PXC7H15 C8H16 PXC8H17 
C9H18 PXC9H19 C10H20 PXC10H21 C12H26 PXC12H25 SXC12H25 S3XC12H25 C12H24 C12H25O2 C12OOH O2C12H24OOH OC12H23OOH )
)
#includeFunc graphCell(name=radial25mm, start=(0.000 0.0 0.0826), end=(0.054 0.0 0.0826), fields=(
T N2 AR H O OH HO2 H2 H2O H2O2 O2 CH2 CH2* CH3 CH4 HCO CH2O CH3O CO CO2 C2H2 C2H3 C2H4 C2H5 C2H6 CH2CHO 
aC3H5 C3H6 nC3H7 C2H3CHO C4H7 C4H81 pC4H9 C5H9 C5H10 PXC5H11 C6H12 PXC6H13 C7H14 PXC7H15 C8H16 PXC8H17 
C9H18 PXC9H19 C10H20 PXC10H21 C12H26 PXC12H25 SXC12H25 S3XC12H25 C12H24 C12H25O2 C12OOH O2C12H24OOH OC12H23OOH )
)
#includeFunc graphCell(name=radial45mm, start=(0.000 0.0 0.0626), end=(0.054 0.0 0.0626), fields=(
T N2 AR H O OH HO2 H2 H2O H2O2 O2 CH2 CH2* CH3 CH4 HCO CH2O CH3O CO CO2 C2H2 C2H3 C2H4 C2H5 C2H6 CH2CHO 
aC3H5 C3H6 nC3H7 C2H3CHO C4H7 C4H81 pC4H9 C5H9 C5H10 PXC5H11 C6H12 PXC6H13 C7H14 PXC7H15 C8H16 PXC8H17 
C9H18 PXC9H19 C10H20 PXC10H21 C12H26 PXC12H25 SXC12H25 S3XC12H25 C12H24 C12H25O2 C12OOH O2C12H24OOH OC12H23OOH )
)

// ************************************************************************* //
