sprayA_v12/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

#runApplication chemkinToFoam -precision 15 \
#               chemkin/chem.inp chemkin/therm.dat chemkin/transportProperties \
#               constant/reactions constant/speciesThermo

runApplication blockMesh

runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructPar

#------------------------------------------------------------------------------
